; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v2)
		(pred_5 ?v6)
		(pred_4 ?v1)
		(pred_6 ?v1)
		(pred_2 ?v6 ?v1)
		(pred_3)
		(pred_1 ?v6))

   (:action op_2
       :parameters  (?v3 ?v4)
       :precondition (and (not-eq ?v3 ?v4) 
                          (pred_4 ?v3) (pred_4 ?v4) (pred_6 ?v3))
       :effect (and  (pred_6 ?v4)
		     (not (pred_6 ?v3))))


   (:action op_3
       :parameters (?v8 ?v5)
       :precondition  (and  (pred_5 ?v8) (pred_4 ?v5)
			    (pred_2 ?v8 ?v5) (pred_6 ?v5) (pred_3))
       :effect (and (pred_1 ?v8)
		    (not (pred_2 ?v8 ?v5)) 
		    (not (pred_3))))

   (:action op_1
       :parameters  (?v8  ?v5)
       :precondition  (and  (pred_5 ?v8) (pred_4 ?v5)
			    (pred_1 ?v8) (pred_6 ?v5))
       :effect (and (pred_2 ?v8 ?v5)
		    (pred_3)
		    (not (pred_1 ?v8)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_06 obj_01 obj_04 obj_05 
          obj_07 obj_02 obj_03 
)
(:init
(pred_4 obj_06)
(pred_4 obj_01)
(pred_4 obj_04)
(pred_4 obj_05)
(pred_5 obj_07)
(pred_5 obj_02)
(pred_5 obj_03)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(pred_3)
(pred_2 obj_07 obj_05)
(pred_2 obj_02 obj_06)
(pred_2 obj_03 obj_04)
(pred_6 obj_01)
)
(:goal
(and
(pred_2 obj_07 obj_05)
(pred_2 obj_02 obj_04)
(pred_2 obj_03 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_02 obj_04) (pred_6 obj_05))
    (sometime-before  (pred_2 obj_03 obj_01) (pred_6 obj_06))
  )
)
)

; plan
1. (op_2 obj_01 obj_04)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_04)
   goals met: 1 of 3
2. (op_3 obj_03 obj_04)
   deleted: (pred_2 obj_03 obj_04) (pred_3)
   added: (pred_1 obj_03)
   goals met: 1 of 3
3. (op_2 obj_04 obj_05)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_05)
   goals met: 1 of 3
4. (op_1 obj_03 obj_05)
   deleted: (pred_1 obj_03)
   added: (pred_2 obj_03 obj_05) (pred_3)
   goals met: 1 of 3
5. (op_2 obj_05 obj_06)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_06)
   goals met: 1 of 3
6. (op_3 obj_02 obj_06)
   deleted: (pred_2 obj_02 obj_06) (pred_3)
   added: (pred_1 obj_02)
   goals met: 1 of 3
7. (op_2 obj_06 obj_04)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_04)
   goals met: 1 of 3
8. (op_1 obj_02 obj_04)
   deleted: (pred_1 obj_02)
   added: (pred_2 obj_02 obj_04) (pred_3)
   goals met: 2 of 3
9. (op_2 obj_04 obj_05)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_05)
   goals met: 2 of 3
10. (op_3 obj_03 obj_05)
   deleted: (pred_2 obj_03 obj_05) (pred_3)
   added: (pred_1 obj_03)
   goals met: 2 of 3
11. (op_2 obj_05 obj_01)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_01)
   goals met: 2 of 3
12. (op_1 obj_03 obj_01)
   deleted: (pred_1 obj_03)
   added: (pred_2 obj_03 obj_01) (pred_3)
   goals met: 3 of 3
